bit-finance/DataProcessors/бит_ИзменениеОтраженийФакта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ИзменениеОтраженийФакта</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Компоновщик</Name>
					<Comment>Компоновщик</Comment>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбрабатываемыеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выполнить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_ОтражениеФактаДДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АналитикиШапки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аналитика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеАналитики</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АналитикиТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Аналитика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачальноеЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонечноеЗначение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.бит_ВидыДополнительныхАналитик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяАналитики</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Безусловно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

bit-finance/DataProcessors/бит_ИзменениеОтраженийФакта/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьАналитикиТабличнойЧасти(АналитикиТЧ, Отбор = Неопределено) Экспорт

	МассивАналитик = Новый Массив;
	
	АналитикиТЧ.Очистить();
	НоваяСтрока = АналитикиТЧ.Добавить();
	НоваяСтрока.Аналитика = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.ЦФО;
	НоваяСтрока.ИмяАналитики = "ЦФО";
	НоваяСтрока.Ключ = "ЦФО";
	МассивАналитик.Добавить(НоваяСтрока.ИмяАналитики);
	
	НоваяСтрока = АналитикиТЧ.Добавить();
	НоваяСтрока.Аналитика = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.СтатьяОборотов;
	НоваяСтрока.ИмяАналитики = "СтатьяОборотов";
	НоваяСтрока.Ключ = "СтатьяОборотов";
	МассивАналитик.Добавить(НоваяСтрока.ИмяАналитики);
	
	НастройкиИзмерений	= бит_МеханизмДопИзмеренийПовтИсп.НастройкиДополнительныхИзмерений();
	
	Для каждого Стр Из НастройкиИзмерений Цикл
	
		НоваяСтрока = АналитикиТЧ.Добавить();
		НоваяСтрока.Аналитика = Стр.Значение.Аналитика;
		НоваяСтрока.ИмяАналитики = Стр.Ключ;
		НоваяСтрока.Ключ = Стр.Ключ; 
		МассивАналитик.Добавить(НоваяСтрока.ИмяАналитики);
		
	КонецЦикла; 
	
	Для каждого ТекущаяСтрока Из АналитикиТЧ Цикл
		
		ИмяАналитики = ТекущаяСтрока.ИмяАналитики;
		ОписаниеТиповАналитики = ТекущаяСтрока.Аналитика.ТипЗначения;
		ТекущаяСтрока.НачальноеЗначение = ОписаниеТиповАналитики.ПривестиЗначение(ТекущаяСтрока.НачальноеЗначение);
		ТекущаяСтрока.КонечноеЗначение = ОписаниеТиповАналитики.ПривестиЗначение(ТекущаяСтрока.КонечноеЗначение);
		ТекущаяСтрока.ИмяАналитики = СокрЛП(ТекущаяСтрока.Аналитика.Код);
		
		Если Отбор <> Неопределено И МассивАналитик.Найти(ИмяАналитики) <> Неопределено Тогда
		
			Для каждого СтрокаОтбора Из Отбор Цикл
				
				ИмяОтбора = Строка(СтрокаОтбора.ЛевоеЗначение); 
				Если Найти(ИмяОтбора, "ФактическиеДанные."+ИмяАналитики) Тогда
					
					ТекущаяСтрока.НачальноеЗначение = СтрокаОтбора.ПравоеЗначение;
					Прервать;
					
				КонецЕсли; 
			
			КонецЦикла; 
		
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
